Series Exercises

In [2]:
import pandas as pd

In [7]:
#1. Create a Series
fruits = pd.Series(['apple', 'banana', 'cherry', 'date'],
                   index=['a','b','c','d'])
print(fruits)
print(fruits.index)

a     apple
b    banana
c    cherry
d      date
dtype: object
Index(['a', 'b', 'c', 'd'], dtype='object')

In [12]:
#2. Accessing Elements: second element
fruits[1]

'banana'

In [25]:
#Series Operations: series with squares of 1-5
squares = pd.Series([1**2, 2**2, 3**2, 4**2, 5**2])
#Adding 10 to each item
squares += 10
print(squares)

0    11
1    14
2    19
3    26
4    35
dtype: int64

DataFrame Exercises

In [70]:
#1. Create a DataFrame
students_list = [
    ['Amelia', 12, 7],
    ['Steve', 18, 12],
    ['Christine', 9, 4]
]
students = pd.DataFrame(students_list, columns=['Name','Age','Grade'])
#2. Accessing Data: printing name column
students['Name']

0       Amelia
1        Steve
2    Christine
Name: Name, dtype: object

In [71]:
#3. DataFrame Operations: adding column for grad status
graduated = []
for i in range(len(students_list)):
    if students['Grade'][i] > 12:
        graduated.append(True)
    else:
        graduated.append(False)
students['Graduated'] = graduated
students

        Name  Age  Grade  Graduated
0     Amelia   12      7      False
1      Steve   18     12      False
2  Christine    9      4      False

In [72]:
#4. Maths: average age of students
students['Age'].mean()

13.0

In [49]:
#5: Sorting: sort students based on age
students.sort_values('Age')

        Name  Age  Grade  Graduated
2  Christine    9      4      False
0     Amelia   12      7      False
1      Steve   18     12      False

In [68]:
#6: Tidy Data: remaking data frame
cog_health = [
    [10, 2, 5, 3],
    [15, 4, 9, 6],
    [18, 7, 12, 9],
    [13, 2, 7, 4]
]
df_cog_health = pd.DataFrame(cog_health, 
                             columns=['happiness', 'language', 'energy', 'memory'])
df_cog_health

   happiness  language  energy  memory
0         10         2       5       3
1         15         4       9       6
2         18         7      12       9
3         13         2       7       4

In [62]:
#Mean of all variables
df_cog_health.mean().mean()

7.875

In [63]:
#Standard deviation of all variables
df_cog_health.std().std()

0.4335482004100443

In [66]:
#Mean for the happiness variable
df_cog_health['happiness'].mean()

14.0

In [67]:
#Standard error for the happiness variable
df_cog_health['happiness'].sem()

1.6832508230603465